[
  {
    "title": "Outil d'aide à l'utilisation de la théorie musicale",
    "description": "Enfin de faciliter l'utilisation de la théorie musicale dans mes compositions, j'ai développé un outil en Python (Tkinter) qui génère des progressions d'accords, des mélodies et des transpositions basés sur des règles théoriques. L'outil permet également d'exporter les résultats au format MIDI pour une utilisation dans des logiciels de production musicale.",
    "image": "SHIMUT.png",
    "tags": ["Python", "Interface", "Musique"],
    "date": "2023",
    "links": [{"url": "https://github.com/trischevreau/SHIMUT", "label": "sur Github"}]
  },
  {
    "title": "Conception d'un compteur de respirations",
    "description": "Dans le cadre d'un projet artistique d'un ami, appelé 'Rencontre en 1000 respirations', j'ai conçu la partie logicielle de compteurs communiquants de respirations humaines utilisant Arduino, Python et le protocole Bluetooth.",
    "image": "1000respirations.png",
    "tags": ["Arduino", "Python", "Prototypage"],
    "date": "avril 2022",
    "links": [{"url": "https://www.youtube.com/watch?v=tle1mi91wjY", "label": "sur Youtube"}]
  },
  {
    "title": "Fabrication d'un joystick DIY pour jeux vidéo rétros",
    "description": "Pour jouer à des jeux vidéo rétros, j'ai fabriqué un joystick DIY en utilisant des composants <i>off the shelf</i>, de l'impression 3D et un peu de travail du bois.",
    "image": ["joystick/1.jpg", "joystick/2.jpg", "joystick/3.jpg"],
    "tags": ["Impression 3D", "Jeux Vidéo", "Prototypage"],
    "date": "décembre 2022",
    "links": null
  },
  {
    "title": "Prospection et tests de nouvelles méthodes de capture pour l'analyse du mouvement",
    "description": "Dans le cadre d'un stage d'application en recherche au sein du Laboratoire DIMEAS de <i>Politecnico di Torino</i>, j'ai exploré et testé 3 méthodes différentes pour obtenir des images synchronisées avec des smartphones pour l'analyse cinématique DICe (Digital Image Correlation). J'ai également développé des scripts en Python pour le traitement et l'analyse des données recueillies. Ce travail a permis de mener à une publication scientifique pour la conférence IMACS.",
    "image": ["DICe/2.png", "DICe/1.png", "DICe/3.png", "DICe/4.jpg"],
    "tags": ["Électronique", "Python", "Data", "Prototypage"],
    "date": "été 2023",
    "links": [
      {"url": "https://link.springer.com/chapter/10.1007/978-3-031-68192-9_16", "label": "la publication"},
      {"url": "assets/pdfs/RapportDICe.pdf", "label": "le rapport"},
      {"url": "https://github.com/trischevreau/Frame-Coupler", "label": "sur Github"}]
  }
]
