[
  {
    "title": "Outil d'aide à l'utilisation de la théorie musicale",
    "description": "Enfin de faciliter l'utilisation de la théorie musicale dans mes compositions, j'ai développé un outil en Python (Tkinter) qui génère des progressions d'accords, des mélodies et des transpositions basés sur des règles théoriques. L'outil permet également d'exporter les résultats au format MIDI pour une utilisation dans des logiciels de production musicale.",
    "image": "SHIMUT.png",
    "tags": ["Python", "Interface", "Musique"],
    "date": "2023",
    "links": [{"url": "https://github.com/trischevreau/SHIMUT", "label": "sur Github"}]
  },
  {
    "title": "Conception d'un compteur de respirations",
    "description": "Dans le cadre d'un projet artistique d'un ami, appelé 'Rencontre en 1000 respirations', j'ai conçu la partie logicielle de compteurs communiquants de respirations humaines utilisant Arduino, Python et le protocole Bluetooth.",
    "image": "1000respirations.png",
    "tags": ["Arduino", "Python", "Prototypage", "Hardware"],
    "date": "avril 2021",
    "links": [{"url": "https://www.youtube.com/watch?v=tle1mi91wjY", "label": "sur Youtube"}]
  },
  {
    "title": "Fabrication d'un joystick DIY pour jeux vidéo rétros",
    "description": "Pour jouer à des jeux vidéo rétros, j'ai fabriqué un joystick DIY en utilisant des composants <i>off the shelf</i>, de l'impression 3D et un peu de travail du bois.",
    "image": ["joystick/1.jpg", "joystick/2.jpg", "joystick/3.jpg"],
    "tags": ["Impression 3D", "Jeux Vidéo", "Prototypage", "Hardware"],
    "date": "décembre 2020",
    "links": null
  },
  {
    "title": "Prospection et tests de nouvelles méthodes de capture pour l'analyse du mouvement",
    "description": "Dans le cadre d'un stage d'application en recherche au sein du Laboratoire DIMEAS de <i>Politecnico di Torino</i>, j'ai exploré et testé 3 méthodes différentes pour obtenir des images synchronisées avec des smartphones pour l'analyse cinématique DICe (Digital Image Correlation). J'ai également développé des scripts en Python pour le traitement et l'analyse des données recueillies. Ce travail a permis de mener à une publication scientifique pour la conférence IMACS.",
    "image": ["DICe/2.png", "DICe/1.png", "DICe/3.png", "DICe/4.jpg"],
    "tags": ["Électronique", "Python", "Data", "Prototypage", "Universitaire"],
    "date": "été 2023",
    "links": [
      {"url": "https://link.springer.com/chapter/10.1007/978-3-031-68192-9_16", "label": "la publication"},
      {"url": "assets/pdfs/RapportDICe.pdf", "label": "le rapport"},
      {"url": "https://github.com/trischevreau/Frame-Coupler", "label": "sur Github"}]
  },
  {
    "title": "Étude des potentiels EnR pour la commune de Rignieux-le-Franc",
    "description": "Dans le cadre d'un projet universitaire mené en groupe, j'ai réalisé une étude sur les potentiels en énergies renouvelables (Photovoltaïque, Méthanisation, Éolien et Hydroelectricité) pour le compte de la commune de Rignieux-le-Franc. En utilisant des données publiques de météo France et des modélisations financières, j'ai proposé des solutions pour optimiser l'utilisation des ressources énergétiques locales.",
    "image": ["rignieux/1.png", "rignieux/2.png"],
    "tags": ["Énergies", "Data", "Universitaire", "Python"],
    "date": "printemps 2024",
    "links": [{"url": "assets/pdfs/RapportEtudeENR.pdf", "label": "le rapport"}]
  },
  {
    "title": "Détection de carences nutritionnelles par l'analyse d'images de feuilles : comparaison des approches descriptives et d'apprentissage profond",
    "description": "Dans le cadre d'un projet universitaire de recherche (PAr) mené en binôme, j'ai mis en place des approches descriptives (extraction de caractéristiques) et d'apprentissage profond (CNN) pour détecter les carences nutritionnelles chez les plantes à partir d'images de feuilles. J'ai évalué les performances de chaque méthode en termes de précision et de robustesse, en utilisant des ensembles de données annotées.",
    "image": ["PAr/1.png", "PAr/2.png", "PAr/3.png"],
    "tags": ["Data", "Python", "Universitaire"],
    "date": "printemps 2023",
    "links": [{"url": "assets/pdfs/RapportPAr147.pdf", "label": "le rapport"}]
  },
  {
    "title": "Refonte d'une salle serveur associative (Réseau, Machines, Virtualisation)",
    "description": "Dans le cadre d'un projet universitaire et associatif, j'ai participé à la refonte complète d'une salle serveur pour une association étudiante. Ce projet comprenait la conception et la mise en place d'une infrastructure réseau robuste, l'installation et la configuration de serveurs physiques et virtuels, ainsi que la mise en œuvre de solutions de virtualisation.",
    "image": ["PE57/1.png", "PE57/2.png", "PE57/3.png"],
    "tags": ["Hardware", "Universitaire", "Associatif", "Réseau"],
    "date": "2022",
    "links": [{"url": "assets/pdfs/RapportPE57.pdf", "label": "le rapport"}]
  },
  {
    "title": "Étude économique d'une rénovation énergétique d'une maison individuelle",
    "description": "Dans le cadre d'un projet universitaire mené en groupe, j'ai réalisé une étude économique sur la rénovation énergétique de maison individuelle. En analysant les coûts, et en simulant les pertes et les économies d'énergie potentielles et les incitations financières disponibles, j'ai proposé différents scénarios de rénovation pour maximiser le retour sur investissement.",
    "image": ["renovation/1.png", "renovation/2.png"],
    "tags": ["Énergies", "Data", "Universitaire"],
    "date": "hiver 2024",
    "links": [{"url": "assets/pdfs/RapportRenovation.pdf", "label": "le rapport"}]
  },
  {
    "title": "Analyse énergétique de la mise en contact de volants d'inertie pour le stockage d'énergie",
    "description": "Dans le cadre d'un projet universitaire mené en groupe, j'ai réalisé une analyse énergétique de la mise en contact de volants d'inertie pour le stockage d'énergie, à l'aide d'une maquette physique et de simulations numériques.",
    "image": ["TIPE/1.png", "TIPE/2.png"],
    "tags": ["Énergies", "Data", "Universitaire", "Arduino"],
    "date": "2021",
    "links": [{"url": "assets/pdfs/TIPE.pdf", "label": "le diapo"}]
  }
]
